using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ScriptTrainer
{
    internal class type
    {
    }

    #region[人物属性]

    /**
     foreach (var item in Config.CharacterPropertyDisplay.Instance)
     {
         Debug.Log($"{item.Name}, {item.TemplateId}");
     }
     */
    public enum CharacterPropertyDisplay
    {
        膂力 = 0,
        灵敏 = 1,
        定力 = 2,
        体质 = 3,
        根骨 = 4,
        悟性 = 5,
        力道 = 6,
        精妙 = 7,
        迅疾 = 8,
        动心 = 9,
        破体 = 10,
        破气 = 11,
        卸力 = 12,
        拆招 = 13,
        闪避 = 14,
        守心 = 15,
        御体 = 16,
        御气 = 17,
        架势恢复 = 18,
        提气恢复 = 19,
        移动速度 = 20,
        步伐稳健 = 21,
        施展速度 = 22,
        引气冲关 = 23,
        兵器切换 = 24,
        攻击速度 = 25,
        内功发挥 = 26,
        调息吐纳 = 27,
        烈毒抵抗 = 28,
        郁毒抵抗 = 29,
        寒毒抵抗 = 30,
        赤毒抵抗 = 31,
        腐毒抵抗 = 32,
        幻毒抵抗 = 33,
        音律资质 = 34,
        弈棋资质 = 35,
        诗书资质 = 36,
        绘画资质 = 37,
        术数资质 = 38,
        品鉴资质 = 39,
        锻造资质 = 40,
        制木资质 = 41,
        医术资质 = 42,
        毒术资质 = 43,
        织锦资质 = 44,
        巧匠资质 = 45,
        道法资质 = 46,
        佛学资质 = 47,
        厨艺资质 = 48,
        杂学资质 = 49,
        音律造诣 = 50,
        弈棋造诣 = 51,
        诗书造诣 = 52,
        绘画造诣 = 53,
        术数造诣 = 54,
        品鉴造诣 = 55,
        锻造造诣 = 56,
        制木造诣 = 57,
        医术造诣 = 58,
        毒术造诣 = 59,
        织锦造诣 = 60,
        巧匠造诣 = 61,
        道法造诣 = 62,
        佛学造诣 = 63,
        厨艺造诣 = 64,
        杂学造诣 = 65,
        内功资质 = 66,
        身法资质 = 67,
        绝技资质 = 68,
        拳掌资质 = 69,
        指法资质 = 70,
        腿法资质 = 71,
        暗器资质 = 72,
        剑法资质 = 73,
        刀法资质 = 74,
        长兵资质 = 75,
        奇门资质 = 76,
        软兵资质 = 77,
        御射资质 = 78,
        乐器资质 = 79,
        内功造诣 = 80,
        身法造诣 = 81,
        绝技造诣 = 82,
        拳掌造诣 = 83,
        指法造诣 = 84,
        腿法造诣 = 85,
        暗器造诣 = 86,
        剑法造诣 = 87,
        刀法造诣 = 88,
        长兵造诣 = 89,
        奇门造诣 = 90,
        软兵造诣 = 91,
        御射造诣 = 92,
        乐器造诣 = 93,
        冷静 = 94,
        聪颖 = 95,
        热情 = 96,
        勇壮 = 97,
        坚毅 = 98,
        福缘 = 99,
        合道 = 100,
        魅力 = 101,
        生育 = 102,
        喜恶变化周期 = 103,
        历练 = 104,
    }

    #endregion

    #region[名誉相关事件]
    /**
     * 
     *  // 获取名誉相关事件
            //for (int i = 0; i < FameAction.Instance.Count; i++)
            //{
            //    Debug.Log($"{FameAction.Instance[i].Name}, {i}");
            //}
     * 
     */
    public enum FameAction
    {
        血债难赎 = 0,
        为民除害 = 1,
        拘人害命 = 2,
        警恶惩奸 = 3,
        义薄云天 = 4,
        纵虎归山 = 5,
        是非不分 = 6,
        嫉恶如仇 = 7,
        嫉恶如仇2 = 8,
        是非不分2 = 9,
        结交良善 = 10,
        结交奸恶 = 11,
        良谊高义 = 12,
        狼狈为奸 = 13,
        佳人才子 = 14,
        败德辱行 = 15,
        救抚良善 = 16,
        藏污纳垢 = 17,
        寄身善贤 = 18,
        认贼为亲 = 19,
        乐善好施 = 20,
        襄助恶人 = 21,
        良师益友 = 22,
        助纣为虐 = 23,
        救死扶伤 = 24,
        养虎遗患 = 25,
        出手伤人 = 26,
        惩戒恶人 = 27,
        偷师窃艺 = 28,
        窃取财物 = 29,
        抢劫财物 = 30,
        掘坟盗墓 = 31,
        施毒害人 = 32,
        落荒而逃 = 33,
        欺凌幼小 = 34,
        趁人之危 = 35,
        比武得胜 = 36,
        比武落败 = 37,
        宅心仁厚 = 38,
        逢恶导非 = 39,
        出言不逊 = 40,
        义正辞严 = 41,
        恣肆无忌 = 42,
        洒脱不羁 = 43,
        唯利是图 = 44,
        大快人心 = 45,
        流言蜚语 = 46,
        软弱可欺 = 47,
        受人恩惠 = 48,
        受人斥责 = 49,
        受人愚弄 = 50,
        受人胁迫 = 51,
        受人称赞 = 52,
        受人嘲笑 = 53,
        前人恩情 = 54,
        前人罪业 = 55,
        芜行俚语 = 56,
        行乞讨钱 = 57,
        庸医害命 = 58,
        行侠仗义 = 59,
        杀害义士 = 60,
        伤风败俗 = 61,
        败坏清规 = 62,
        罔顾人伦 = 63,
        欺师背祖 = 64,
        负心薄幸 = 65,
        衣冠禽兽 = 66,
        受人羞辱 = 67,
        自取其辱 = 68,
    }

    #endregion

    #region[人物特性]

    /**
     * 
     * foreach (var item in Config.CharacterFeature.Instance)
            {
                int a = item.GetCharacterPropertyBonusInt(ECharacterPropertyReferencedType.Strength);
                Debug.Log($"{item.Name}, {item.TemplateId}");
            }
     * 
     */
    public enum CharacterFeature
    {
        孔武有力 = 0,
        牛虎怪力 = 1,
        拔山扛鼎 = 2,
        文弱无力 = 3,
        无力缚鸡 = 4,
        力若蚍蜉 = 5,
        身强体健 = 6,
        龙神马壮 = 7,
        天人骨血 = 8,
        身如薄柳 = 9,
        弱不禁风 = 10,
        羸弱早夭 = 11,
        耳聪目明 = 12,
        剖决如流 = 13,
        诡变无踪 = 14,
        蛮手蛮脚 = 15,
        手拙口夯 = 16,
        钝似泥偶 = 17,
        骨骼清奇 = 18,
        形正神明 = 19,
        仙胎仙骨 = 20,
        气不入骨 = 21,
        七窍晦杂 = 22,
        浊尘刍狗 = 23,
        才思敏捷 = 24,
        灵心慧性 = 25,
        智绝无双 = 26,
        傻头傻脑 = 27,
        呆若木鸡 = 28,
        蠢笨如猪 = 29,
        刚毅隐忍 = 30,
        心清意明 = 31,
        琨玉秋霜 = 32,
        心猿意马 = 33,
        柔懦寡断 = 34,
        桃花七煞 = 35,
        良才美玉 = 36,
        不世奇才 = 37,
        天元一气 = 38,
        杂芥根性 = 39,
        四体畸拙 = 40,
        天残地缺 = 41,
        善解人意 = 42,
        八面玲珑 = 43,
        超凡脱俗 = 44,
        喜怒无常 = 45,
        尖酸刻薄 = 46,
        狂妄乖戾 = 47,
        福星高照 = 48,
        禄马同乡 = 49,
        如天至福 = 50,
        破禄之运 = 51,
        背禄逐马 = 52,
        丧门灾星 = 53,
        皮坚骨硬 = 54,
        钢筋铁骨 = 55,
        金刚不坏 = 56,
        面色无华 = 57,
        久伤不愈 = 58,
        纤柔玉体 = 59,
        六脉调和 = 60,
        周天不息 = 61,
        天人合一 = 62,
        经络阻断 = 63,
        阴虚气短 = 64,
        死脉之体 = 65,
        容光焕发 = 66,
        生龙活虎 = 67,
        百病不侵 = 68,
        体弱多病 = 69,
        五劳七伤 = 70,
        百病缠身 = 71,
        克己慎行 = 72,
        沉稳果决 = 73,
        稳如磐石 = 74,
        意气用事 = 75,
        横冲直闯 = 76,
        恣意忘我 = 77,
        三元汇聚 = 78,
        先天气体 = 79,
        身披华光 = 80,
        水火不济 = 81,
        五气冲克 = 82,
        真元溃散 = 83,
        意定神闲 = 84,
        神融气泰 = 85,
        八脉天通 = 86,
        心浮气躁 = 87,
        忧思郁结 = 88,
        三焦逆乱 = 89,
        沉静寡言 = 90,
        处变不惊 = 91,
        优游自若 = 92,
        紧张不安 = 93,
        妄言轻动 = 94,
        札手舞脚 = 95,
        思虑入微 = 96,
        洞若观火 = 97,
        火眼金睛 = 98,
        迟疑寡决 = 99,
        一步一鬼 = 100,
        颠倒衣裳 = 101,
        眼疾手快 = 102,
        听风辨位 = 103,
        蹑影藏形 = 104,
        反应迟钝 = 105,
        左右不分 = 106,
        身心不一 = 107,
        胆大于身 = 108,
        无所畏惧 = 109,
        舍生忘死 = 110,
        性情荏弱 = 111,
        萎靡不振 = 112,
        胆小如鼠 = 113,
        临机应变 = 114,
        沉机观变 = 115,
        穷极要妙 = 116,
        木讷鲁直 = 117,
        鲁莽妄动 = 118,
        冯河暴虎 = 119,
        动如脱兔 = 120,
        电光石火 = 121,
        奔逸绝尘 = 122,
        慵懒迟钝 = 123,
        怠惰因循 = 124,
        身重神昏 = 125,
        杀气腾腾 = 126,
        心无恻隐 = 127,
        恶鬼罗刹 = 128,
        心柔面软 = 129,
        宋襄之仁 = 130,
        悲花悯草 = 131,
        脉象殷实 = 132,
        气海充盈 = 133,
        真气精纯 = 134,
        脉象虚浮 = 135,
        气海空虚 = 136,
        真气驳杂 = 137,
        五行俱全 = 138,
        太和灵气 = 139,
        混元奇窍 = 140,
        心神散漫 = 141,
        命门不开 = 142,
        顽石铁胎 = 143,
        健步如飞 = 144,
        高视阔步 = 145,
        夭矫如龙 = 146,
        步履蹒跚 = 147,
        东倒西歪 = 148,
        蜗行牛步 = 149,
        体质特异 = 150,
        冰心玉骨 = 151,
        百毒不侵 = 152,
        邪质入体 = 153,
        气血涣散 = 154,
        先天隐疾 = 155,
        手长脚长 = 156,
        亭亭鹤立 = 157,
        蜂腰猿背 = 158,
        头重脚轻 = 159,
        怪模怪样 = 160,
        诡状异形 = 161,
        情有独钟 = 162,
        从一而终 = 163,
        忠贞不渝 = 164,
        三心二意 = 165,
        见异思迁 = 166,
        朝三暮四 = 167,
        无根之人 = 168,
        石芯玉女 = 169,
        阴阳一体 = 170,
        一支毛笔 = 171,
        一副人偶 = 172,
        一只刨子 = 173,
        一支玉箫 = 174,
        一根草药 = 175,
        一支拂尘 = 176,
        一颗骰子 = 177,
        一块玉佩 = 178,
        一撮泥土 = 179,
        一把小刀 = 180,
        一串佛珠 = 181,
        一盒胭脂 = 182,
        生于寅月 = 183,
        生于卯月 = 184,
        生于辰月 = 185,
        生于巳月 = 186,
        生于午月 = 187,
        生于未月 = 188,
        生于申月 = 189,
        生于酉月 = 190,
        生于戌月 = 191,
        生于亥月 = 192,
        生于子月 = 193,
        生于丑月 = 194,
        真阳纯阴 = 195,
        杂阳毁阴 = 196,
        身怀六甲 = 197,
        被迫屈从 = 198,
        龙岛忠仆 = 199,
        经文祝祷 = 200,
        璞玉韬光 = 201,
        神锋敛彩 = 202,
        梦境中人 = 203,
        执迷入邪 = 204,
        执迷化魔 = 205,
        三百戒杖 = 206,
        八脉俱损 = 207,
        断恶去能 = 208,
        髓中种蛊 = 209,
        天人轮回 = 210,
        人间轮回 = 211,
        非天轮回 = 212,
        地狱轮回 = 213,
        饿鬼轮回 = 214,
        傍生轮回 = 215,
        神魂俱安 = 216,
        相枢入邪 = 217,
        相枢化魔 = 218,
        相枢化身 = 219,
        神女还剑 = 220,
        镇狱伏邪 = 221,
        奇寒灵气 = 222,
        七文五彩 = 223,
        倾国绝世 = 224,
        龙胎化命 = 225,
        溶尘化玉 = 226,
        八肱八趾 = 227,
        方天敕令 = 228,
        相枢真身 = 229,
        乌碑化生 = 230,
        天枢玄身 = 231,
        语茯化生 = 232,
        紫竹化生 = 233,
        服食仙丹 = 234,
        服食仙丹2 = 235,
        服食仙丹3 = 236,
        青蛛母毒 = 237,
        青蛛母毒3 = 238,
        青蛛母毒4 = 239,
        七星调元 = 240,
        七星调元2 = 241,
        七星调元3 = 242,
        狮相雄威 = 243,
        狮相雄威2 = 244,
        狮相雄威3 = 245,
        眼耳剧痛 = 246,
        眼耳伤坏 = 247,
        胸背剧痛 = 248,
        胸背伤坏 = 249,
        腰腹剧痛 = 250,
        腰腹伤坏 = 251,
        肩臂剧痛 = 252,
        肩臂伤坏 = 253,
        膝踵剧痛 = 254,
        膝踵伤坏 = 255,
        白额灵蛇 = 256,
        天助善缘 = 257,
        福深贵重 = 258,
        途坦无束 = 259,
        心慈无病 = 260,
        好生寿长 = 261,
        芦花赐啼 = 262,
        麻鸡赐啼 = 263,
        雉鸡赐啼 = 264,
        竹鸡赐啼 = 265,
        黑羽赐啼 = 266,
        鹑尾赐啼 = 267,
        马鸡赐啼 = 268,
        赤足赐啼 = 269,
        窗禽赐啼 = 270,
        元宝赐啼 = 271,
        丹鸡赐啼 = 272,
        虢国赐啼 = 273,
        祝祝赐啼 = 274,
        长尾赐啼 = 275,
        银锦赐啼 = 276,
        金锦赐啼 = 277,
        琅琊赐啼 = 278,
        碧鸡赐啼 = 279,
        梅林赐啼 = 280,
        孙枝赐啼 = 281,
        会稽赐啼 = 282,
        五黑赐啼 = 283,
        桃源赐啼 = 284,
        胡须赐啼 = 285,
        鹿苑赐啼 = 286,
        峨眉赐啼 = 287,
        烛夜赐啼 = 288,
        怀乡赐啼 = 289,
        五灰赐啼 = 290,
        茶花赐啼 = 291,
        固始赐啼 = 292,
        乌骨赐啼 = 293,
        约瓦赐啼 = 294,
        静宁赐啼 = 295,
        黑凤赐啼 = 296,
        长鸣赐啼 = 297,
        略阳赐啼 = 298,
        安南赐啼 = 299,
        花尾赐啼 = 300,
        文昌赐啼 = 301,
        雪鸡赐啼 = 302,
        白头赐啼 = 303,
        六指赐啼 = 304,
        五色赐啼 = 305,
        七彩赐啼 = 306,
        封川赐啼 = 307,
        海陵赐啼 = 308,
        上谷赐啼 = 309,
        宁都赐啼 = 310,
        青州赐啼 = 311,
        黔香赐啼 = 312,
        招财赐啼 = 313,
        越王赐啼 = 314,
        金羽赐啼 = 315,
        建宁赐啼 = 316,
        云松赐啼 = 317,
        突厥赐啼 = 318,
        九真赐啼 = 319,
        长安赐啼 = 320,
        昆仑赐啼 = 321,
        金足赐啼 = 322,
        鹖鸡赐啼 = 323,
        鶤鸡赐啼 = 324,
        闻恶声 = 325,
        祛善 = 326,
        唤目 = 327,
        妖心示显 = 328,
        百邪 = 329,
        堕心九部众 = 330,
        众相生 = 331,
        神断护法 = 332,
        玄狱九老 = 333,
        大王赐啼 = 334,
        服芝食玉 = 335,
    }

    #endregion

    #region[人物性格]

    /**
     *  foreach (var item in Config.BehaviorType.Instance)
            {
                Debug.Log($"{item.Name}, {item.TemplateId}");
            }
     */
    public enum BehaviorType
    {
        刚正 = 0,
        仁善 = 1,
        中庸 = 2,
        叛逆 = 3,
        唯我 = 4,
    }

    #endregion

    #region[身体部分]

    /**
     * 
     * foreach (var item in Config.BodyPart.Instance)
            {
                Debug.Log($"{item.Name}, {item.TemplateId}");
            }
     */
    public enum BodyPart
    {
        胸背 = 0,
        腰腹 = 1,
        头颈 = 2,
        左臂 = 3,
        右臂 = 4,
        左腿 = 5,
        右腿 = 6,
    }

    #endregion

    #region[人物称号]

    /**
     * 
     * foreach (var item in Config.CharacterTitle.Instance)
            {
                Debug.Log($"{item.Name} = {item.TemplateId}");
            }
     * 
     */
    public enum CharacterTitle
    {
        相枢化身 = 0,
        相枢真身 = 1,
        紫竹化身 = 2,
        浑心无字 = 3,
        白衣行化 = 4,
        大全千法 = 5,
        象龙演画 = 6,
        心观残笺 = 7,
        八埏至宝 = 8,
        化影奇功 = 9,
        无名神剑 = 10,
        十杀魔罗 = 11,
        一画开天 = 12,
        无先玄元 = 13,
        九似真藏 = 14,
        天通神术 = 15,
        神女绝音 = 16,
        武林盟主 = 17,
        促织将军 = 18,
    }

    #endregion

    #region[战斗难度]

    /**
     * 
     *  foreach (var item in Config.CombatDifficulty.Instance)
            {
                Debug.Log($"{item.Name} = {item.TemplateId}");
            }
     * 
     */
    public enum CombatDifficulty
    {
        普通 = 0,
        困难 = 1,
        极难 = 2,
        必死 = 3,
    }

    #endregion

    #region[战斗评价]

    /**
     * 
     *  foreach (var item in Config.CombatEvaluation.Instance)
            {
                Debug.Log($"{item.Name} = {item.TemplateId}");
            }
     * 
     */
    public enum CombatEvaluation
    {
        技不如人 = 0,
        不分胜负 = 1,
        落荒而逃 = 2,
        克敌制胜 = 3,
        切磋感悟 = 4,
        见招拆招 = 5,
        险恶之战 = 6,
        生死之战 = 7,
        神剑归心 = 8,
        以多欺少 = 9,
        欺凌幼小 = 10,
        装备凌弱 = 11,
        真气凌弱 = 12,
        武学凌弱 = 13,
        精纯凌弱 = 14,
        趁人之危 = 15,
        以少胜多 = 16,
        初生之犊 = 17,
        装备胜强 = 18,
        真气胜强 = 19,
        武学胜强 = 20,
        精纯胜强 = 21,
        河东狮吼 = 22,
        举手之劳 = 23,
        驱魔除邪 = 24,
        行侠仗义 = 25,
        消灭外道 = 26,
        伤天害理 = 27,
        杀害义士 = 28,
        狮相雄威 = 29,
        狮相雄威2 = 30,
        狮相雄威3 = 31,
        返璞归真 = 32,
        实战领悟 = 33,
    }

    #endregion

    #region[功法类型]

    /**
     * 
     *  foreach (var item in Config.CombatSkillProperty.Instance)
            {
                Debug.Log($"{item.Name} = {item.TemplateId}");
            }
     * 
     */
    public enum CombatSkillProperty
    {
        当前威力 = 0,
        威力上限 = 1,
        施展速度 = 2,
        气势消耗 = 3,
        内功比例 = 4,
        内功转换 = 5,
        内力总量 = 6,
        获取内力 = 7,
        五行转移 = 8,
        万用格数 = 9,
        脚力消耗 = 10,
        移动速度 = 11,
        增加力道 = 12,
        增加精妙 = 13,
        增加迅疾 = 14,
        增加动心 = 15,
        身法持续 = 16,
        身法消耗 = 17,
        增加御体 = 18,
        增加御气 = 19,
        增加卸力 = 20,
        增加拆招 = 21,
        增加闪避 = 22,
        增加守心 = 23,
        反击威力 = 24,
        外伤反震 = 25,
        内伤反震 = 26,
        反震距离 = 27,
        持续时间 = 28,
        提高攻击 = 29,
        提高命中 = 30,
        力道成数 = 31,
        精妙成数 = 32,
        迅疾成数 = 33,
        攻击范围 = 34,
        攻击胸背 = 35,
        攻击腰腹 = 36,
        攻击头部 = 37,
        攻击双手 = 38,
        攻击双足 = 39,
        封穴程度 = 40,
        破绽程度 = 41,
        施加烈毒 = 42,
        施加郁毒 = 43,
        施加寒毒 = 44,
        施加赤毒 = 45,
        施加腐毒 = 46,
        施加幻毒 = 47,
    }

    /**
     * 
     * foreach (var item in Config.CombatSkillType.Instance)
            {
                Debug.Log($"{item.Name} = {item.TemplateId}");
            }
     * 
     */
    public enum CombatSkillType
    {
        内功 = 0,
        身法 = 1,
        绝技 = 2,
        拳掌 = 3,
        指法 = 4,
        腿法 = 5,
        暗器 = 6,
        剑法 = 7,
        刀法 = 8,
        长兵 = 9,
        奇门 = 10,
        软兵 = 11,
        御射 = 12,
        乐器 = 13,
    }

    #endregion

    
}
